#for ციკლი

#მომხმარებელს შეაყვანინე რიცხვი n. for ციკლით დაბეჭდე 1-დან n-მდე ყველა რიცხვი და თითოეულის კვადრატი.
#მაგალითად: 3 → 1, 4, 9

#შექმენი პროგრამა, რომელიც 1-დან 100-მდე გაივლის და დაბეჭდავს მხოლოდ იმ რიცხვებს, რომლებიც 3-ზეც და 5-ზეც იყოფა.

#მომხმარებელს შეაყვანინე 5 რიცხვი. for ციკლით იპოვე და დაბეჭდე მათი ჯამი და საშუალო არითმეტიკული.

#1)
num = int(input('enter youre n: '))
for i in range(1, num + 1):
    print(i ** 2)

#2)
for i in range(1, 100):
    if i % 3 == 0  and i % 5 == 0:
        print(i)

#3)

#for i in range(5):
#    num = int(input('enter youre number: '))
