#for ციკლი

#მომხმარებელს შეაყვანინე რიცხვი n. for ციკლით დაბეჭდე 1-დან n-მდე ყველა რიცხვი და თითოეულის კვადრატი.
#მაგალითად: 3 → 1, 4, 9

#შექმენი პროგრამა, რომელიც 1-დან 100-მდე გაივლის და დაბეჭდავს მხოლოდ იმ რიცხვებს, რომლებიც 3-ზეც და 5-ზეც იყოფა.

#მომხმარებელს შეაყვანინე 5 რიცხვი. for ციკლით იპოვე და დაბეჭდე მათი ჯამი და საშუალო არითმეტიკული.

#1)
num = int(input('enter youre n: '))
for i in range(1, num + 1):
    print(i ** 2)

#2)
for i in range(1, 100):
    if i % 3 == 0  and i % 5 == 0:
        print(i)

#3)

for i in range(5):
    num = int(input('enter youre number: '))
    print(i)

#while ციკლი

#მომხმარებელს შეაყვანინე რიცხვი. while-ის გამოყენებით დაითვალე, რამდენი ციფრისგან შედგება ეს რიცხვი.

#შექმენი პაროლის პროგრამა. მომხმარებელს ჰქონდეს 3 მცდელობა სწორი პაროლის შესაყვანად.
#თუ სწორად შეიყვანა → "სწორია"
#თუ 3-ჯერ შეცდა → "დაგებლოკა"

#მომხმარებელს შეაყვანინე რიცხვები მანამ, სანამ არ შეიყვანს 0-ს. ბოლოს დაბეჭდე შეყვანილი რიცხვების ჯამი. 0 ჯამში არ უნდა ჩაითვალოს.

#1)
num = int(input('enter youre number:'))
count = 0

if num == 0:
    count = 1

#2)
password = 'python'

attemtes = 0

while attemtes < 3:
    if password == password:
        print('სწორია')
        break

    attemtes += 1
    print('არასწორია თავიდან ცადეთ')


if attemtes == 3:
    print('blocked')

#3)

total = 0

while True:
    num = int(input('enter youre number: '))
    if num == 0:
        break
    total += num
print(total)

#სიები — List

#შექმენი რიცხვების სია. for ციკლით იპოვე და დაბეჭდე რამდენი ლუწი და რამდენი კენტი რიცხვია სიაში.

#შექმენი რიცხვების სია და შექმენი მეორე, ცარიელი სია. პირველი სიიდან მხოლოდ 10-ზე მეტი რიცხვები დაამატე მეორე სიაში append()-ით.

#შექმენი 5 რიცხვის სია. იპოვე ყველაზე დიდი და ყველაზე პატარა რიცხვი, მაგრამ არ გამოიყენო max() და min() — გამოიყენე for და if.

num = ['']


