#1)კომენტარების სახით ახსენით თუ რაარის p,h1,a,br,hr თეგები
#2)კომენტარების სახით ახსენით თუ რაარის id
#3)კომენტარების სახთ ახსენით თუ რაგანსხვავებაა id სა და class შორის
#4)ააწყვეთ სარეგისტრაციო ფორმა სადაც მომხმარებელი შემოიყვანს მის სახელს,გვარს,ემაილს,პაროლს,ტელეფონის ნომერს 
#5)კომენტარების სახით ახსენით თუ რას აკეტებს select თეგი და გააკეტეთ 1 მაგალითი


#1)
# p - ამ თაგის დახმარებით შენ შეგიძლია html ში ინფორმაცია ჩაწერო, ეს არის ყველაზე პატარა დანარჩენებიდან.
# h1 - ეს თაგი არის მთავარი ტექსტი რის შესახებადაც გინდა რამის წერა დაიწყო იგივე სათაური.
# a - ეს არის ლინკის ჩასაგდები თაგი
# br - ეს თაგი არის იგივე შიფტი ანუ ხაზის გამოტოვება შეგიძლია
# hr - ამ თაგის დახმარებით შეგიძლია წინადადებას დაბლა ხაზი გაუსვა

#2)







#3)


#python
#6)Nested for loop-ის გამოყენებით დაბეჭდეთ ყველა შესაძლო წყვილი 1-დან 5-მდე რიცხვებით
#7)შექმენი ცვლადი user_name= "gio". დაბეჭდე ეს სახელი ისე, რომ პირველი ასო იყოს დიდი
#8)კომენტარების სახით ახსენი თუ რასაკეტებს .lower(), .split(), .find(), .split() და გააკეთეთ 1-1 მაგალითი
#9)შექმენიტ ცვლადი country = "Georgia" და slicing ის გამოყენებით ამოიღე ბოლო 3 სიმბოლო და გადაიყვანე .upper() სი


#6)

for i in range(1, 6):
    for j in range(1,6):
        print(i, j)

#7)
user_name = 'gio'
print(user_name.capitalize())

#8)
# lower - ყველა დიდ ასოს აპატარავებს.
# split - თითოეულ წინადადებას ფრჩხილებში წვავს და ბრჭყალებს უკეთებს.
# find - ითვლის თუ ინდექსზე რიცხვზე არის რაიმე ასო.
# upper - არ წერია მარა ყველა პატარა ასოს ადიდებს.

#9)
country = 'georgia'
print(country[-3:].upper())



