#level 03:

#1) კომენტარებით ახსენით რას აკეთებს ნაშთიანი გაყოფის ოპერატორი ( % ).

#2) კომენტარებით ახსენით როგორ უნდა ავიყვანოთ რიცხვი ხარისხში Python-ში.

#3) შექმენი ცვლადი, სადაც შეინახავ 6-ის მეორე ხარისხს. შემდეგ დაბეჭდე ეს ცვლადი. კომენტარით მიუწერე რა იქნება შედეგი.

#4) კომენტარებში დაწერე რას გამოიტანს:
 #  - 17 % 5
 #  - 25 % 4
 #  - 30 % 7

#5) კომენტარებით ახსენით რა არის მონაცემთა ტიპები (Data Types).

#6) ჩამოწერე Python-ის ძირითადი მონაცემთა ტიპები.

#7) თითოეულ მონაცემთა ტიპს კომენტარებით მიუწერე განმარტება.

#8) შექმენი ცვლადი, სადაც შეინახავ შენს სახელს, მეორე ცვლადში შენს ასაკს, ხოლო მესამე ცვლადში იმას, გყავს თუ არა შინაური ცხოველი. შემდეგ დაბეჭდე ყველა ცვლადი.

#9) შექმენი ცვლადი, სადაც შეინახავ შენი მეგობრის სახელს, მეორე ცვლადში მის ასაკს, ხოლო მესამე ცვლადში მის სიმაღლეს. შემდეგ დაბეჭდე ყველა ცვლადი.

#10) შექმენი ორი რიცხვითი ცვლადი. იპოვე მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი და ნაშთი. თითოეული შედეგი დაბეჭდე.

#11) შექმენი ცვლადი number, სადაც შეინახავ ნებისმიერ რიცხვს. აიყვანე ის მესამე ხარისხში და დაბეჭდე შედეგი.

#12) შექმენი Boolean ტიპის ორი ცვლადი: ერთში შეინახე True, მეორეში False. შემდეგ ორივე დაბეჭდე.

#13) კომენტარებით ახსენით რა განსხვავებაა int-სა და float-ს შორის.

#14) შექმენი ცვლადი `price`, სადაც შეინახავ პროდუქტის ფასს, და ცვლადი `quantity`, სადაც შეინახავ რაოდენობას. გამოთვალე საერთო ღირებულება და დაბეჭდე.

#15) კომენტარებით ახსენით რისთვის გამოიყენება print() ფუნქცია Python-ში



#1)
   #ნაშთიანი გაყოფის ოპერატორი % აბრუნებს გაყოფის შემდეგ დარჩენილ ნაშთს
#2)
   #python-ში რიცხვის ხარისხში აყვანა ხდება ორი ფიფქით (**)
#3)
square = 6 ** 2
print(square)
#4)
   # - 17 % 5 = 2
   # - 25 % 4 = 1
   # - 30 % 7 = 2
#5)
   # მონაცემთა ტიპები განსაზღვრავს, რა სახის მონაცემი ინახება ცვლადში.
#6)
   # 1) integer(int) , string(str) , float , boolean(bool)
#7)
   # მონაცემთა ტიპებია # int - მთელი რიცხვების მონაცემთა ტიპი

   # float - ათწილადი რიცხვების მონაცემთა ტიპი

   # str - ტექსტის (სტრიქონის) მონაცემთა ტიპი

   # bool - ლოგიკური მონაცემთა ტიპი, რომელსაც აქვს ორი მნიშვნელობა: True და False
#8)
name = "temo"
age = 16
has_pet = True

print(name)
print(age)
print(has_pet)
#9)
friend_name = "sandro"
his_age = 17
his_height = 175

print(friend_name)
print(his_age)
print(his_height)
#10)
a = 5
b = 10

print(10 + 5)
print(10 - 5)
print(10 * 5)
print(10 / 5)
print(10 & 5)
#11)
number = 4
print(4 ** 3)
#12)
i_have_dog = True
i_have_cat = False

print("true")
print("false")
#13)
  #integer(int) - არის დადებითი ან უარყოფითი რიცხვები ათწილადის გარეშე
  #float - არის რიცხვი წილადით ან ათწილადით
  # განსხვავბეა ისარის რომ int პროსტა რიცხვებია ხოლო flaot ათწილადი და წილადი
#14)
price = 10
quantity = 3

print(price + quantity)
#15)
# print() ფუნქცია გამოიყენება ეკრანზე ინფორმაციის გამოსატანად
# ანუ რასაც ჩავწერთ print()-ში, ის გამოჩნდება კონსოლში (ტერმინალში)
