#level 04:
#1) კომენტარების სახით ახსენით რა არის input ფუნქცია და რისთვის გამოიყენება
#2) მომხმარებელს შემოატანინე თავისი სახელი და დაბეჭდე რა სახელი შემოიტანა
#3) მომხმარებელს შემოატანინე თავისი საყვარელი ფერი და დაპეჭდეთ
#4) კომენტარებით ახსენით რა არის f sring
#5) მომხმარებელს შემაოყვანინე თავისი ასაკი და დაბეჭდეთ fსტრინგით "I am {მომხმარებლის ასაკი აქ} years old"

#1)
# input ფუნქცია გამოიყენება მომხმარებლისგან ინფორმაციის მისაღებად
# როდესაც პროგრამა input-ს შეხვდება, დაელოდება სანამ მომხმარებელი რამეს შეიყვან
#2)
name = input("enter youre name - ") 
print(name)
#3)
fav_collor = input("fav collor - ")
print(fav_collor)
#4)
# f-string არის ტექსტსში (string-ის) ჩაწერის მარტივი და მოსახერხებელი გზა
#5)
customers_age = input("enter youre age - ")
print(f"I am {customers_age} years old")