#level 10:
#1. მომხმარებელს შემოატანინე რიცხვი.
#თუ რიცხვი დადებითია, დაბეჭდე `"დადებითი რიცხვია"`.
#თუ რიცხვი უარყოფითია, დაბეჭდე `"უარყოფითი რიცხვია"`.
#სხვა შემთხვევაში, დაბეჭდე `"ნულის ტოლია"`.

#2. მომხმარებელს შემოატანინე ასაკი.
#თუ ასაკი ნაკლებია 18-ზე, დაბეჭდე `"არასრულწლოვანი"`.
#თუ ასაკი 18-დან 64-მდეა, დაბეჭდე `"ზრდასრული"`.
#სხვა შემთხვევაში, დაბეჭდე `"პენსიონერი"`.

#3. მომხმარებელს შემოატანინე გამოცდის ქულა.
#თუ ქულა 90-100 შუალედშია, დაბეჭდე `"A"`.
#თუ ქულა 80-89 შუალედშია, დაბეჭდე `"B"`.
#თუ ქულა 70-79 შუალედშია, დაბეჭდე `"C"`.
#თუ ქულა 60-69 შუალედშია, დაბეჭდე `"D"`.
#სხვა შემთხვევაში, დაბეჭდე `"F"`.

#1)
num = int(input("enter number: "))

if num > 0:
    print("დადებითი რიცხვია")
elif num < 0:
    print("უარყოფითი რიცხვია")
else:
    print("ნულის ტოლია")


#2)
age = int(input('enter youre age: '))

if age < 18:
    print("არასრულწლოვანი")
elif age <= 64:
    print("ზრდასრული")
else:
    print("პენსიონერი")

#3)
score = int(input("enter score: "))

if score >= 90 and score <= 100:
    print("A")
elif score >= 80:
    print("B")
elif score >= 70:
    print("C")
elif score >= 60:
    print("D")
else:
    print("F")