#level 10:
#1. მომხმარებელს შემოატანინე რიცხვი.
#თუ რიცხვი დადებითია, დაბეჭდე `"დადებითი რიცხვია"`.
#თუ რიცხვი უარყოფითია, დაბეჭდე `"უარყოფითი რიცხვია"`.
#სხვა შემთხვევაში, დაბეჭდე `"ნულის ტოლია"`.

#2. მომხმარებელს შემოატანინე ასაკი.
#თუ ასაკი ნაკლებია 18-ზე, დაბეჭდე `"არასრულწლოვანი"`.
#თუ ასაკი 18-დან 64-მდეა, დაბეჭდე `"ზრდასრული"`.
#სხვა შემთხვევაში, დაბეჭდე `"პენსიონერი"`.

#3. მომხმარებელს შემოატანინე გამოცდის ქულა.
#თუ ქულა 90-100 შუალედშია, დაბეჭდე `"A"`.
#თუ ქულა 80-89 შუალედშია, დაბეჭდე `"B"`.
#თუ ქულა 70-79 შუალედშია, დაბეჭდე `"C"`.
#თუ ქულა 60-69 შუალედშია, დაბეჭდე `"D"`.
#სხვა შემთხვევაში, დაბეჭდე `"F"`.

#1)
