#level 02:
#1) რას უდრის 1 byte?
#2) რას უდრის 1 GB?
#3) ახსენი რა არის  და რისთვის გამოიყენება CPU.
#4) ახსნეი რა არის Low level და High level.
#5) ჩამოწერე კომენტარებით ყველა მათემატიკური მოქმედება.
#6) შექმენი ცვლადი სახელად num1 და გაუტოლე მნიშვნელობა 5, შემდეგ შექმენი ცვლადი სახელად num2 და შეინახე მნიშვნელობა 10, შემდეგ დაბეჭდე ამ ორი ცვლადის ჯამი
#7) შექმენი ორი ცვლადი და შენიახერ ერთში 20, მეორეში 5. დაპრინტე ამ ორ ცვლადის გაყოფა
#8) სექმენი სამი ცვლადი a, b, c.  გაუტოლე ეს ცვლადები 5, 10, 2 და მათზე მოახდინე სამივე რიცხვის ერთმანეთზე გამრავლება

#1) 1 byte უდრის 8 bits
#2) 1 gb უდრის 1024 MB
#3) cpu გამოიყენება რაიმის გასახსნელად ან თუნდაც რაიმეს ჩასატვირთვად, იგივე მეორე ტვინია pc-ს
#4) Low level არის მაგალითად c++ ანუ შედარებით ძნელია, ხოლო high level არის ადვილი როგორიც არის python
#5) #ჯამი  +
#სხვაობა  -
#გამრავლება  *
#გაყოფა  /
#ტოლობა =
#6)num1 = 5
num2 = 10
print(num1 + num2)
#7)saba = 20
nika = 5
print( saba / nika)
#8)a = 5
b = 10
c = 2
print(a * b * c)