#level 03:
#1) კომენტარებით ახსენით რას აკეთებს პროცენტული გაყოფა ( % )
#2) ახსენით როგორ უნდა ავიყვანოთ რიცხვი ხარისხში
#3) შექმენი ვლადი და შიგნით 5 აიყვანე 2 ხარისხში, შემდეგ კი დაპრინტე ეს ცვლადი. კომენტარით მიუწერე რა იქნება შედეგი
#4) კომენტარში დაწერეთ რას გამოიტანს 13%3
#5) კომენტარებით  ახსენით რა არის მონაცემთა ტიპები
#6) ჩამოწერეთ ყველა მოაცემთა ტიპი
#7) ჩამოწერილ მონაცემთა ტიპებს მიუწერეთ განმარტებები
#8) შექმენი სახელის ცვლადი სადაც შეინახავ შენს ასაკს, შემდეგ შექმენი ცვლადი სადაც შეინახავ  გყავს თუ არა შინაური ცხოველი, საბოლოოდ დაპრინტე ორივე ცვლადი.
#9)შექმენი ცვლადი სადაც შეინახავ შენი მეგობრის სახელს, შემდეგ შექმენი ცვლადი სადაც შეინახავ მეგობრის ასაკს, შექმენი ცვლადი სადაც შეინახავ მეოგბრის სიმაღლეს და შემდეგ დაპრინტე ყველა ცვლადი.

#1) პროცენტული გაყოფა ( % ) გვაძლევს ნაშთს რიცხვის გაყოფისას
#2) რიცხვის ხარისხში აყვანა ხდება ორი ფიფქით **
#3) მაგალითად
x = 5
x = x ** 2
print(x)
#4) 13%3 გამოიტანს 1
print(13 % 3)
#5) # int (მთელი რიცხვი)
age = 18  # მთელი რიცხვი, წერტილის გარეშე
print(type(age))

# float (ათწილადი რიცხვი)
price = 19.99  # რიცხვი წერტილით
print(type(price))

# str (ტექსტი)
name = "Giorgi"  # ტექსტი ყოველთვის ბრჭყალებშია
print(type(name))

# bool (True / False)
is_student = True  # მხოლოდ True ან False
print(type(is_student))
#6) მონაცემთა ტიპებია
   # int, float, str, bool
#7) int - მთელი რიცხვი, float - ათწილადი რიცხვი, str - ტექსტი, bool - True ან False
#8) #8

# ჩემი ასაკი (number)
age = 16

# შინაური ცხოველი გყავს თუ არა (True / False)
has_pet = True

# ორივე ცვლადის დაბეჭდვა
print(age)
print(has_pet)
#9
# მეგობრის სახელი (text)
friend_name = "Giorgi"

# მეგობრის ასაკი (number)
friend_age = 17

# მეგობრის სიმაღლე (float)
friend_height = 1.95

# ყველა ცვლადის დაბეჭდვა
print(friend_name)
print(friend_age)
print(friend_height)